# İleri Toplulaştırma İşlemleri(Aggregate, filter, transform, apply)

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({'gruplar': ["A", "B", "C", "A", "B", "C"],
                  'değişken1': [10, 23, 33, 22, 11, 99],
                  'değişken2': [100, 253, 333, 262, 111, 969]}, 
                 columns=["gruplar", "değişken1", "değişken2"])
df

  gruplar  değişken1  değişken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [4]:
#aggregate

In [5]:
df.groupby("gruplar").mean()

         değişken1  değişken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [6]:
# Özellikle sadece getirmesini istediğimiz şeyleri bu şekilde aggregate ile yapabiliriz
df.groupby("gruplar").aggregate(["min", np.median, max])

C:\Users\Emre\AppData\Local\Temp\ipykernel_13152\546688888.py:2: FutureWarning: The provided callable <function median at 0x00000191A857E520> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby("gruplar").aggregate(["min", np.median, max])
C:\Users\Emre\AppData\Local\Temp\ipykernel_13152\546688888.py:2: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby("gruplar").aggregate(["min", np.median, max])

        değişken1            değişken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [7]:
df.groupby("gruplar").aggregate({"değişken1":"min", "değişken2":"max"})

         değişken1  değişken2
gruplar
A               10        262
B               11        253
C               33        969

In [8]:
#Filter

In [9]:
df = pd.DataFrame({'gruplar': ["A", "B", "C", "A", "B", "C"],
                  'değişken1': [10, 23, 33, 22, 11, 99],
                  'değişken2': [100, 253, 333, 262, 111, 969]}, 
                 columns=["gruplar", "değişken1", "değişken2"])
df

  gruplar  değişken1  değişken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [10]:
def filter_fun(x):
    return x["değişken1"].std() > 9

In [11]:
df.groupby("gruplar").std()

         değişken1   değişken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [12]:
df.groupby("gruplar").filter(filter_fun)

  gruplar  değişken1  değişken2
2       C         33        333
5       C         99        969

In [13]:
#Transform

In [14]:
df = pd.DataFrame({'gruplar': ["A", "B", "C", "A", "B", "C"],
                  'değişken1': [10, 23, 33, 22, 11, 99],
                  'değişken2': [100, 253, 333, 262, 111, 969]}, 
                 columns=["gruplar", "değişken1", "değişken2"])
df

  gruplar  değişken1  değişken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [15]:
df["değişken1"] * 9

0     90
1    207
2    297
3    198
4     99
5    891
Name: değişken1, dtype: int64

In [16]:
df.transform(lambda x:x-x.mean(numeric_only=True))

   değişken1  değişken2 gruplar
0      -23.0     -238.0     NaN
1      -10.0      -85.0     NaN
2        0.0       -5.0     NaN
3      -11.0      -76.0     NaN
4      -22.0     -227.0     NaN
5       66.0      631.0     NaN

In [17]:
#Bir başka yöntem
df_a =df.iloc[:, 1:3]

In [18]:
df_a.transform(lambda x:(x-x.mean()) / x.std())

   değişken1  değişken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [19]:
#apply

In [20]:
df = pd.DataFrame({'değişken1': [10, 23, 33, 22, 11, 99],
                  'değişken2': [100, 253, 333, 262, 111, 969]}, 
                 columns=["değişken1", "değişken2"])
df

   değişken1  değişken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [21]:
df.apply(np.sum)

değişken1     198
değişken2    2028
dtype: int64

In [22]:
df.apply(np.mean)

değişken1     33.0
değişken2    338.0
dtype: float64

In [23]:
df = pd.DataFrame({'gruplar': ["A", "B", "C", "A", "B", "C"],
                  'değişken1': [10, 23, 33, 22, 11, 99],
                  'değişken2': [100, 253, 333, 262, 111, 969]}, 
                 columns=["gruplar", "değişken1", "değişken2"])
df

  gruplar  değişken1  değişken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [24]:
df.groupby("gruplar").apply(np.sum)

C:\Users\Emre\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:86: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)
C:\Users\Emre\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:86: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)
C:\Users\Emre\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:86: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)
C:\Users\Emre\AppData\Local\Temp\ipykernel_13152\2155945059.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby("gruplar").apply(np.sum)

        gruplar  değişken1  değişken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302